In [1]:
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
titanic = sns.load_dataset('titanic')
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
nan_deck = titanic['deck'].count()
print(nan_deck)

203

In [5]:
print(titanic.head().isnull())  #NaN 갯수 확인

   survived  pclass    sex    age  sibsp  parch   fare  embarked  class  \
0     False   False  False  False  False  False  False     False  False
1     False   False  False  False  False  False  False     False  False
2     False   False  False  False  False  False  False     False  False
3     False   False  False  False  False  False  False     False  False
4     False   False  False  False  False  False  False     False  False

     who  adult_male   deck  embark_town  alive  alone
0  False       False   True        False  False  False
1  False       False  False        False  False  False
2  False       False   True        False  False  False
3  False       False  False        False  False  False
4  False       False   True        False  False  False

In [6]:
print(titanic.head().notnull()) #NaN 아닌 갯수 확인

   survived  pclass   sex   age  sibsp  parch  fare  embarked  class   who  \
0      True    True  True  True   True   True  True      True   True  True
1      True    True  True  True   True   True  True      True   True  True
2      True    True  True  True   True   True  True      True   True  True
3      True    True  True  True   True   True  True      True   True  True
4      True    True  True  True   True   True  True      True   True  True

   adult_male   deck  embark_town  alive  alone
0        True  False         True   True   True
1        True   True         True   True   True
2        True  False         True   True   True
3        True   True         True   True   True
4        True  False         True   True   True

In [7]:
print(titanic.isnull().sum(axis = 0)) #NaN 갯수 확인 -> 더해서 전체 갯수 확인

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
nan_df = titanic.isnull()
print(nan_df.columns)
#print(nan_df)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [9]:
for col_name in nan_df.columns:# colume_name 
    nan_count = nan_df[col_name].value_counts()

    try :
        print(col_name, ' : ', nan_count[True])  #isnull = true = NaN
    except :
        print(col_name, ' : ', 0)  #isnull = true = NaN

survived  :  0
pclass  :  0
sex  :  0
age  :  177
sibsp  :  0
parch  :  0
fare  :  0
embarked  :  2
class  :  0
who  :  0
adult_male  :  0
deck  :  688
embark_town  :  2
alive  :  0
alone  :  0

In [10]:
# dropna : DataFrame 열 날리기, NaN >= 500 ==> 열삭제 (axis:1) => df_remain
df_remain = titanic.dropna(axis=1, thresh=500)
print(df_remain.isnull().sum(axis = 0))
print(df_remain.columns)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
embark_town      2
alive            0
alone            0
dtype: int64
Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [11]:
df_remain = df_remain.dropna(axis = 0, subset=['age']) # => 행을 삭제 (axis:0)

In [12]:
print(df_remain.isnull().sum(axis = 0))

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64

In [13]:
print(df_remain['embark_town'].value_counts())
max_town = df_remain['embark_town'].value_counts().idxmax()
print(max_town)

Southampton    554
Cherbourg      130
Queenstown      28
Name: embark_town, dtype: int64
Southampton

In [14]:
df_remain['embark_town'].fillna(max_town, inplace=True)     #1 임의 데이터 삽입

In [15]:
print(df_remain.isnull().sum(axis = 0))

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [16]:
df_remain['embarked'].fillna(method='ffill', inplace = True) #2 근처 데이터 삽입

In [17]:
print(df_remain.isnull().sum(axis = 0))

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64